## Q1: What are missing values in a dataset? Why is it essential to handle missing values? Name some algorithms that are not affected by missing values.

In [1]:
## If a person creates a google form and the some entries are not filled by sample of people then missing values are created.
## If there are large number of missing values then model gets bised towards the missing values.
## Model may not be trained well, so missing values must be filled.

## Q2: List down techniques used to handle missing data. Give an example of each with python code.

In [2]:
## Mean imputation
## Median imputation
## Mode imputation

In [4]:
## Mean imputation
import pandas as pd
import seaborn as sns

In [27]:
df = sns.load_dataset('titanic')

In [28]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [34]:
df['age'].isnull().value_counts()

False    714
True     177
Name: age, dtype: int64

In [44]:
df['age_mean']=df['age'].fillna(df['age'].mean())

In [45]:
df['age_mean']

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age_mean, Length: 891, dtype: float64

In [47]:
df['age_mean'].isnull().value_counts()

False    891
Name: age_mean, dtype: int64

In [49]:
df[['age_mean','age']]

      age_mean   age
0    22.000000  22.0
1    38.000000  38.0
2    26.000000  26.0
3    35.000000  35.0
4    35.000000  35.0
..         ...   ...
886  27.000000  27.0
887  19.000000  19.0
888  29.699118   NaN
889  26.000000  26.0
890  32.000000  32.0

[891 rows x 2 columns]

In [50]:
## Median Imputation

In [51]:
df['age_median']=df['age'].fillna(df['age'].median())

In [52]:
df[['age_median','age']]

     age_median   age
0          22.0  22.0
1          38.0  38.0
2          26.0  26.0
3          35.0  35.0
4          35.0  35.0
..          ...   ...
886        27.0  27.0
887        19.0  19.0
888        28.0   NaN
889        26.0  26.0
890        32.0  32.0

[891 rows x 2 columns]

In [53]:
## Mode Imputation

In [54]:
df['deck'].isnull().value_counts()

True     688
False    203
Name: deck, dtype: int64

In [62]:
mode_value = df[df['deck'].notna()]['deck'].mode()[0]

In [63]:
df['deck_mode']=df['deck'].fillna(mode_value)

In [64]:
df[['deck_mode','deck']]

    deck_mode deck
0           C  NaN
1           C    C
2           C  NaN
3           C    C
4           C  NaN
..        ...  ...
886         C  NaN
887         B    B
888         C  NaN
889         C    C
890         C  NaN

[891 rows x 2 columns]

## Q3: Explain the imbalanced data. What will happen if imbalanced data is not handled?

In [65]:
## Imbalanced data means if there are two different groups of people suppose some sayine yes and other sayning no and if there 
##  is large difference between them then data is said to be imbalanced.

## ex:- there are 1000 people, 900-say YES and 100-say NO then there is huge gap so, data is imbalanced.

## Model will be biased towards yes data. So data should be handled.

## Q4: What are Up-sampling and Down-sampling? Explain with an example when up-sampling and down- sampling are required.

In [67]:
## Up sampling and down sampling are methods to handle imbalanced data.
## Up-Sampling:- there are 1000 people, 900-say YES and 100-say NO then there is huge gap so, data is imbalanced upsampling
##                helps to increase minority class to majority class.

## Down-Sampling:- down sampling is used to reduce the majority class to minority class level.

## Q5: What is data Augmentation? Explain SMOTE.

In [68]:
## Data agumentation is the technique of incerasing training data between two datapoints.

## SMOTE :- smote is used to increase data points.
## Synthetic minority oversampling technique.
## two values from minority class will be taken and new values will be added between them and in that way oversampling is done.

## Q6: What are outliers in a dataset? Why is it essential to handle outliers?

In [69]:
## Outliers ore those values which are very greater or very small compared to given data.
## Outliers are essential to handle because they make lot of difference when statistical analysis is done.
## They change the complete mean of data, so they must be handled.

## Q7: You are working on a project that requires analyzing customer data. However, you notice that some of the data is missing. What are some techniques you can use to handle the missing data in your analysis?

In [70]:
## 1) If data is very big then drop missing value rows.
## 2) If data is continuous then use mean imputation.
## 3) If data is having outliers then use Median Imputation.
## 4) If data is categorical then use Mode Imputation.

## Q8: You are working with a large dataset and find that a small percentage of the data is missing. What are some strategies you can use to determine if the missing data is missing at random or if there is a pattern to the missing data?

In [71]:
## Missing values are compared with observed data and if there is no any specific reason for missing data 
##   then it is said to be missing at random.

## Observed data should be taken or stored properly so that data doen not miss.

## Q9: Suppose you are working on a medical diagnosis project and find that the majority of patients in the dataset do not have the condition of interest, while a small percentage do. What are some strategies you can use to evaluate the performance of your machine learning model on this imbalanced dataset?

In [72]:
## Data should be handled first.
## Methods like up-sampling and down-sampling are used to handle the data.
## SMOTE is also used to oversample the data so that model does not get biased.
## Data interpolation can be done to increase data points.

## Q10: When attempting to estimate customer satisfaction for a project, you discover that the dataset is unbalanced, with the bulk of customers reporting being satisfied. What methods can you employ to balance the dataset and down-sample the majority class?

In [73]:
## To balance the dataset:-
## Data should be handled first.
## Methods like up-sampling and down-sampling are used to handle the data.
## SMOTE is also used to oversample the data so that model does not get biased.
## Data interpolation can be done to increase data points.

## To down-sample majority class:-
## To down-sample the majority class down-sampling method is used.
## A subset of majority class is selected equal to number of miority class data points.

## Q11: You discover that the dataset is unbalanced with a low percentage of occurrences while working on a project that requires you to estimate the occurrence of a rare event. What methods can you employ to balance the dataset and up-sample the minority class?

In [74]:
## To balance the dataset:-
## Data should be handled first.
## Methods like up-sampling and down-sampling are used to handle the data.
## SMOTE is also used to oversample the data so that model does not get biased.
## Data interpolation can be done to increase data points.

## Up-sample the data set:-
## to upsample the dataset Up-sampling technique is used.
## In this method any two points are taken and between them new data points are added. And they are made equal to majority class.